{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.15.0", "signature": {"inputs": {"x": {"name": "x:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16000"}]}}}, "outputs": {"class_ids": {"name": "Identity:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "class_names": {"name": "Identity_1:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}, "predictions": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}}}, "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "16000"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Shape", "op": "Shape", "input": ["x"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/GatherV2/params", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ArgMax/dimension", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/GatherV2/axis", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/zeros_like", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat/axis", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/ones_like", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/floordiv_3/y", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_1/values_1/1", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_1/axis", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/range_1/start", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/range_1/delta", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/floordiv_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_2/shape/1", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_3", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "255"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/strided_slice", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Const", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/add/x", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape/shape_1", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame_step", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame_length", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/packed", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/split/split_dim", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_2/axis", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/hann_window/sub_2", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "255"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/rfft/Pad/paddings", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/rfft/fft_length", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack_1", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack_2", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/resizing_1/resize/size", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_17", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/normalization_1/truediv_recip", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/flatten_1/Const", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12544"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/split", "op": "SplitV", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/packed", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/split/split_dim"], "attr": {"Tlen": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "num_split": {"i": "3"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_30", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "^StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp", "^StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "^StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp", "^StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/split:1", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape/shape_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/floordiv_3", "op": "FloorDiv", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/floordiv_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame_length"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_1/values_1", "op": "Pack", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/floordiv_3", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_1/values_1/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/floordiv_3"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/floordiv", "op": "FloorDiv", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/sub_2", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame_step"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/split", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_1/values_1", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/split:2", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/floordiv_3", "ConstantFolding/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/add", "op": "AddV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/add/x", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/floordiv"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/split", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat/values_1", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/split:2", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Const", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/add"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/StridedSlice", "op": "StridedSlice", "input": ["x", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/zeros_like", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/ones_like"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/range_1", "op": "Range", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/range_1/start", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Maximum", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/range_1/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_2/shape", "op": "Pack", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Maximum", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_2/shape/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/packed_1", "op": "Pack", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Maximum", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame_length"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/StridedSlice", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/range_1", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/floordiv_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_2", "op": "ConcatV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/split", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/packed_1", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/split:2", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/mul_1", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_2", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_3"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_1", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/add_1", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/strided_slice"], "attr": {"Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_4", "op": "Reshape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/GatherV2", "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_2"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/mul", "op": "Mul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_4", "StatefulPartitionedCall/StatefulPartitionedCall/stft/hann_window/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/rfft/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/mul", "StatefulPartitionedCall/StatefulPartitionedCall/stft/rfft/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/rfft", "op": "RFFT", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/rfft/Pad", "StatefulPartitionedCall/StatefulPartitionedCall/stft/rfft/fft_length"], "attr": {"Treal": {"type": "DT_FLOAT"}, "Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Abs", "op": "ComplexAbs", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/stft/rfft"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Abs", "StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack", "StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/resizing_1/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/strided_slice", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/resizing_1/resize/size"], "attr": {"align_corners": {"b": false}, "T": {"type": "DT_FLOAT"}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/normalization_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/resizing_1/resize/ResizeBilinear", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/normalization_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/normalization_1/sub", "ConstantFolding/StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/normalization_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/normalization_1/truediv", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_2/Relu", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_3/Relu", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/flatten_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_2/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_2/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_3/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_2/Relu", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ArgMax", "op": "ArgMax", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_3/MatMul", "StatefulPartitionedCall/StatefulPartitionedCall/ArgMax/dimension"], "attr": {"output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_3/MatMul", "^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_30", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/GatherV2/params", "StatefulPartitionedCall/StatefulPartitionedCall/ArgMax", "StatefulPartitionedCall/StatefulPartitionedCall/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_STRING"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/ArgMax", "^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_30", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/GatherV2", "^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_30", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_STRING"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/StatefulPartitionedCall/GatherV2/params", "shape": [8], "dtype": "string"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ArgMax/dimension", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/zeros_like", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/ones_like", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/floordiv_3/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_1/values_1/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/range_1/start", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/range_1/delta", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/floordiv_2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_2/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_3", "shape": [1, 255], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Const", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/add/x", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape/shape_1", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame_step", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame_length", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/packed", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/hann_window/sub_2", "shape": [255], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/rfft/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/stft/rfft/fft_length", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/resizing_1/resize/size", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_17", "shape": [1, 1, 1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/normalization_1/truediv_recip", "shape": [1, 1, 1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "shape": [12544, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp", "shape": [128, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat/values_1_const_axis", "shape": [], "dtype": "int32"}]}]}